{
  "backend/main.mo": "Simple canister storing and retrieving caller-specific canister IDs using a Map.",
  "feature_evidence.json": "Feature evidence report mapping redesign requirements to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/DOMAIN_SETUP.md": "Guide for configuring a custom domain for the IC-hosted ElectroBeez app with DNS and boundary node steps.",
  "frontend/index.css": "Global Tailwind-based styles defining color tokens, glassmorphism utilities, and dark-mode variables.",
  "frontend/index.html": "HTML entry point setting metadata, favicon, and loading the app via main.tsx.",
  "frontend/src/App.tsx": "Root React component rendering LandingPage and ensuring redeploy marker inclusion.",
  "frontend/src/components/landing/AmbientBackground.tsx": "Component rendering animated ambient orbs and gradient shimmer unless reduced-motion is enabled.",
  "frontend/src/components/landing/LandingPage.tsx": "Composes all landing-page sections with ambient effects and a white background layout.",
  "frontend/src/components/landing/SectionNav.tsx": "Sticky scroll-reactive navigation bar with smooth scrolling, mobile menu, and contact info.",
  "frontend/src/components/landing/sections/AboutSection.tsx": "About section with user and electrician feature cards using glassmorphism and icon lists.",
  "frontend/src/components/landing/sections/BenefitsSection.tsx": "Displays a grid of benefit cards highlighting project advantages using icons and styled UI components.",
  "frontend/src/components/landing/sections/BudgetSection.tsx": "Shows budget breakdown cards with costs and descriptions plus a total budget card and donate button.",
  "frontend/src/components/landing/sections/DonationSection.tsx": "Renders donation options including a QR scan section and detailed bank transfer information within a styled card.",
  "frontend/src/components/landing/sections/FooterSection.tsx": "Provides footer content with branding, navigation links, contact details, and dynamic year display.",
  "frontend/src/components/landing/sections/HeroSection.tsx": "Defines the hero banner with logo, tagline, call‑to‑action buttons, and feature highlight cards.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor instance based on user identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider to manage Internet Identity login, loading stored identities, and exposing login state helpers.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, glassmorphism components, and ambient animation utilities for the site's visual theme.",
  "frontend/src/lib/contact.ts": "Exports centralized contact details including email and phone in raw and display formats.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/redeployMarker.ts": "Exports a timestamped marker object to force bundle changes for redeployment.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, radius, animations, typography, and dark mode support.",
  "project_state.json": "Stores project metadata, requirements, design notes, known issues, and deployment state."
}