{
  "backend/main.mo": "Actor storing and retrieving per-caller canister IDs using a Map with a trap if unset.",
  "feature_evidence.json": "JSON report listing features, associated files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Text file containing prewritten 1–2 sentence summaries for multiple frontend source files.",
  "frontend/DEPLOYMENT_TROUBLESHOOTING.md": "Guide explaining how to verify deployments and force redeploys using the redeploy marker system.",
  "frontend/DOMAIN_SETUP.md": "Documentation for configuring a custom domain for the IC-hosted ElectroBeez canister, including DNS and registration steps.",
  "frontend/index.css": "Global Tailwind CSS setup defining color variables, dark mode values, and base styling rules.",
  "frontend/index.html": "HTML entry point defining the root element, favicon, metadata, and script loader for main.tsx.",
  "frontend/src/App.tsx": "App root that renders the LandingPage and logs the REDEPLOY_MARKER for deployment verification.",
  "frontend/src/components/landing/AmbientBackground.tsx": "Component rendering animated ambient background orbs with reduced‑motion support.",
  "frontend/src/components/landing/LandingPage.tsx": "Top-level landing page layout composing sections with ambient background and navigation.",
  "frontend/src/components/landing/SectionNav.tsx": "Sticky navigation bar with smooth scrolling, mobile menu, and contact info access.",
  "frontend/src/components/landing/sections/AboutSection.tsx": "About section showing user and electrician features with icon cards and descriptive lists.",
  "frontend/src/components/landing/sections/BenefitsSection.tsx": "Renders a grid of benefit cards describing project advantages like job creation and instant service. Uses icons and styled cards for a landing page section.",
  "frontend/src/components/landing/sections/BudgetSection.tsx": "Displays budget breakdown cards with amounts and descriptions plus a total budget call-to-action. Used for showing project funding needs.",
  "frontend/src/components/landing/sections/DonationSection.tsx": "Provides donation options including a YouTube video, QR code, and bank transfer details within a styled card. Encourages user contributions.",
  "frontend/src/components/landing/sections/FooterSection.tsx": "Renders footer with brand info, navigation links, contact details, and director phone numbers. Pulls data from CONTACT config.",
  "frontend/src/components/landing/sections/HeroSection.tsx": "Landing hero section with a YouTube video, headline, description, CTAs, and feature highlight cards. Serves as the main introduction to the project.",
  "frontend/src/components/landing/sections/WorkInProgressSection.tsx": "Empty placeholder file for a future landing page section.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an authenticated or anonymous backend actor, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, managing identity state, login, logout, and AuthClient creation.",
  "frontend/src/index.css": "Defines Tailwind CSS base styles, theme variables, dark mode settings, glassmorphism components, and ambient animation utilities.",
  "frontend/src/lib/contact.ts": "Exports static contact information including email and a list of directors with phone numbers.",
  "frontend/src/main.tsx": "Bootstraps the React app, setting up React Query and the Internet Identity provider before rendering App.",
  "frontend/src/redeployMarker.ts": "Contains a timestamped build marker used to force redeploys by changing the bundle hash.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, radii, fonts, animations, and plugin integrations.",
  "project_state.json": "Describes current project state, including schema version, features, and deployment-related metadata."
}