{
  "kind": "build_request",
  "title": "Full futuristic/professional redesign (white background, single-shade blue accents, subtle ambient motion)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-19",
      "text": "Redesign the landing page as a full layout + section redesign (still a single long scrolling page), while keeping the existing content meaning and the existing section anchors usable for navigation: #home, #about, #budget, #benefits, #donate.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-13",
          "msg-17",
          "msg-19"
        ],
        "quotes": [
          "Should be Full redesign of layout and sections and keep the background colour as white and others blue",
          "...the layout remain a single long landing page",
          "Proceed now"
        ]
      },
      "acceptanceCriteria": [
        "The site remains a single-page landing experience (no route-based multi-page navigation).",
        "Top navigation links continue to scroll smoothly to the same anchor IDs: #home, #about, #budget, #benefits, #donate.",
        "All existing core sections (Hero, Donation, About, Budget, Benefits, Footer) are still present, but their layout/visual structure is fully redesigned."
      ]
    },
    {
      "id": "REQ-20",
      "text": "Enforce a white background across the website (light mode) and ensure the overall visual styling remains futuristic and professional with a clean, high-end look.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3",
          "msg-5",
          "msg-13"
        ],
        "quotes": [
          "Change website backround colour to White",
          "Make the website futuristic and professional",
          "...keep the background colour as white..."
        ]
      },
      "acceptanceCriteria": [
        "In light mode, the main page background renders as white (no tinted page-wide background fill).",
        "Sections that use gradients do not remove the overall white-background feel (gradients must be subtle overlays, not solid tinted section fills).",
        "Typography, spacing, and component styling look cohesive and intentionally 'futuristic/professional' across the entire page."
      ]
    },
    {
      "id": "REQ-21",
      "text": "Constrain the color system so that all non-white accents use a single consistent shade of blue (used for primary actions, links, highlights, icons, borders/rings), and avoid introducing additional accent hues.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-13",
          "msg-17"
        ],
        "quotes": [
          "...keep the background colour as white and others blue",
          "Should all non-white elements (text, buttons, sections, accents) use the simple shade of blue..."
        ]
      },
      "acceptanceCriteria": [
        "Primary CTAs, interactive states (hover/focus), and key highlights use one consistent blue shade (no multiple different blues for accents).",
        "No new accent color families (e.g., green/purple/orange) are introduced for decorative emphasis; neutrals + the single blue are used.",
        "Theme tokens in the Tailwind/Shadcn system remain consistent with the single-blue constraint (primary/ring/accent usage does not drift into other hues)."
      ]
    },
    {
      "id": "REQ-22",
      "text": "Add subtle ambient motion/3D-style effects to the landing page design, using lightweight visual techniques (e.g., glassmorphism panels, soft gradients, floating shapes, gentle animated highlights) without making the page feel distracting.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7",
          "msg-17"
        ],
        "quotes": [
          "Expecting motion/3D elements (subtle animations, gradients, glassmorphism)",
          "...need subtle ambient animations (gradients, glassmorphism, floating shapes)..."
        ]
      },
      "acceptanceCriteria": [
        "At least 2–3 distinct ambient motion elements are present (e.g., slowly floating blurred shapes, subtle animated gradient sheen, gentle hover micro-interactions).",
        "Glassmorphism is used intentionally on key surfaces (e.g., nav on scroll, hero/donation card treatments) via translucency + blur, while keeping readability high.",
        "Animations respect accessibility: if the user has reduced-motion enabled, motion effects are reduced/disabled (no continuously moving elements)."
      ]
    },
    {
      "id": "REQ-23",
      "text": "Update the sticky top navigation visual treatment to match the futuristic redesign (white background context + glassmorphism on scroll), while preserving existing navigation behavior and contact CTA usability.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5",
          "msg-7",
          "msg-19"
        ],
        "quotes": [
          "Make the website futuristic and professional",
          "Expecting motion/3D elements (subtle animations, gradients, glassmorphism)",
          "Proceed now"
        ]
      },
      "acceptanceCriteria": [
        "The nav remains fixed at the top and continues to change style on scroll as it does now (scrolled vs not scrolled state).",
        "The scrolled state uses a futuristic/glass-like style (translucent + blur), consistent with the single-blue accent constraint.",
        "Desktop and mobile menu interactions still work (open/close, smooth scroll to anchors, Donate/Support button scrolls to #donate)."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui (compose only).",
    "Do not add new backend services or databases; keep the backend as a single Motoko actor (no backend changes required for this redesign).",
    "Use English for any user-facing text changed/added as part of the redesign."
  ],
  "nonGoals": [
    "Do not convert the site into a multi-page app with routing.",
    "Do not add authentication flows or new backend-driven features.",
    "Do not change donation/bank details content, contact details, or directors list content (only restyle/re-layout them as part of the redesign)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}